/*
5. 온도를 입력받아 섭씨 온도는 화씨 온도로, 화씨 온도는 섭씨 온도로 변환하는 프로그램을 작성하시오.
"27 C" 또는 "27 F"처럼 온도를 입력받을 때 섭씨인지 화씨인지 구분할 수 있는 문자를 함께 입력받는다.
함께 입력된 문자가 'C'면 섭씨 온도이므로 화씨 온도를 구해서 출력하고, 입력된 문자가 'F'면 화씨 온도이므로 섭씨 온도를 구해서 출력한다.

섭씨 온도 = ( 화씨 온도 - 32 ) X 5/9
화씨 온도 = ( 섭씨 온도 X 5/9 ) + 32


실행결과
온도? [26 C]
26.00 C ==> 78.80 F

*/

#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
int pa05_05(void)
{
	float temp;
	char ch;
	printf("온도? ");
	scanf("%f %c", &temp, &ch);

	if (ch == 'C') 
	{
		printf("%.2f C ==> %.2f F",temp ,(temp * (9.0 / 5.0))+32 );
	}
	
	if (ch == 'F')
	{
		printf("%.2f F ==> %.2f C",temp, (temp - 32.0) * (5.0 / 9.0));
	}
}